frontend/controllers/UserController.php

SELECT * FROM `user` WHERE `id`=225
---
		        public function actionProfile()
				{
					$this->layout='profile';
				      $model = new RegisterMaster();
					  $userData = RegisterMaster::find()->where(['uid'=> Yii::$app->user->id])->one();
					  $userMain = UserMaster::find()->where(['id' => Yii::$app->user->id])->one();