backend/modules/products/controllers/ProductsController.php

SELECT * FROM `product_nutrition` WHERE `productCode`='WHTR'
---
    public function actionView($id)
    {
    	$model = $this->findModel($id);
    	$model->nutritionInfo = ProductNutrition::find()->where(['productCode' => $model->productCode])->one();