backend/modules/products/views/products/_form.php

SELECT * FROM `categories`
---
			    </div>

				 <div class="form-group col-lg-6 col-sm-12">
							       <?= $form->field($model, 'categoryId')->dropDownList(
							       ArrayHelper::map(Categories::find()->orderBy([
	       'categoryName'=>SORT_ASC

		])->all(), 'categoryId', 'categoryName'),
							        ['prompt' => 'categoryName' ]) ?>