backend/modules/role/controllers/RolesController.php

INSERT INTO `role` (`RoleName`, `description`, `createdDate`, `updatedDate`, `ipAddress`) VALUES ('sdfsf', 'sdf', NOW(), NOW(), '::1')
---
    public function actionCreate()
    {
        $model = new Role();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {

SELECT * FROM `role` WHERE `RoleId`='9'
---
    protected function findModel($id)
    {
        if (($model = Role::findOne($id)) !== null) {