backend/models/Brandsmaster.php

    public static function  getBrandId($name)
    {
    	$brandsInfo = Brandsmaster::find()->select('brandId')->where(['brandName' => $name])->one();
---
SELECT `brandId` FROM `brandsmaster` WHERE `brandName`='brand1'