backend/models/Products.php

SELECT `id` FROM `products` WHERE `productName`='Atlanta'
---
    public static function  getProductId($name)
    {
    	$productInfo = Products::find()->select(['id'])->where(['productName' => $name])->one();