frontend/models/Countries.php

SELECT `id`, `name` FROM `countries` WHERE `sortname` IN ('US', 'CA')
---
    public static function getCountriesUS()
    {
    	$countriesModel = Countries::find()->select(['id', 'name'])->where(['IN', 'sortname', ['US','CA']])
    ->asArray()
    	->all();

SELECT `id`, `name` FROM `states` WHERE `country_id`='231'
---
    public static function getStatesByCountryDefault($countryId)
    {
    	$statesModel = States::find()->select(['id', 'name'])->asArray()->where(['country_id'=>$countryId])
    	->all();

SELECT `name` FROM `countries` WHERE `id`='231'
---
    public static function getCountryName($countryId)
    {
    	$countryName = Countries::find()->select(['name'])->asArray()->where(['id'=>$countryId])
    	->one();