frontend/models/Membershipdetails.php

SELECT `MemId`, `MembershipName`, `cost` FROM `membershipdetails` WHERE `status`='Active'
---
    public function getPackages() {
    	$packagesModel = Membershipdetails::find()->select(['MemId', 'MembershipName','cost'])->where(['status' => 'Active'])
    	->asArray()
    	->all();