frontend/models/States.php

    public static function getStateName($stateId)
    {
    	$statesModel = States::find()->select(['name'])->asArray()->where(['id'=>$stateId])
    	->one();
---
SELECT `name` FROM `states` WHERE `id`='3925'